app/controllers/projects_controller.rb

  def index
    @project = Project.all
---
SELECT `projects`.* FROM `projects`

  def create
    @project = Project.create!(project_params)
---
INSERT INTO `projects` (`created_at`, `description`, `outcome`, `prerequisites`, `updated_at`) VALUES ('2014-08-07 11:55:10', 'Mydesc', 'Myotc', 'Mypr', '2014-08-07 11:55:10')

  def destroy
    @project = Project.find(params[:id])
    destroy = @project.destroy
---
SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 1 LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 1

  def show
    @project = Project.find(params[:id])
---
SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 1 LIMIT 1